app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-10-13 10:49:59.732079"], ["updated_at", "2017-10-13 10:49:59.732079"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 980190962], ["cart_id", 980190962], ["created_at", "2017-10-12 11:08:22.687864"], ["updated_at", "2017-10-12 11:08:22.687864"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2017-10-14 15:15:20.376391"], ["id", 18]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)
    # @line_item = @cart.line_items.build(product: product)

    respond_to do |format|
      if @line_item.save